scripts/perf/api_test.yaml
config:
  target: "${APP_SCHEME}://${APP_HOST}:${APP_PORT}"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 30
      arrivalRate: 2
    - duration: 30
      arrivalRate: 2
    - duration: 30
      arrivalRate: 5
    - duration: 30
      arrivalRate: 10
    - duration: 30
      arrivalRate: 20
    - duration: 60
      arrivalRate: 50
    - duration: 60
      arrivalRate: 100
  payload:
    - path: query_vocab_gen.txt
      fields:
        - word1
      order: random
      skipHeader: true
    - path: query_vocab_gen.txt
      fields:
        - word2
      order: random
      skipHeader: true
    - path: query_vocab.txt
      fields:
        - word3
      order: random
      skipHeader: true
    - path: query_vocab_gen.txt
      fields:
        - word4
      order: random
      skipHeader: true
    - path: query_vocab_gen.txt
      fields:
        - word5
      order: random
      skipHeader: true
    - path: query_vocab.txt
      fields:
        - word6
      order: random
      skipHeader: true
    - path: query_vocab_gen.txt
      fields:
        - word7
      order: random
      skipHeader: true
    - path: query_vocab_gen.txt
      fields:
        - word8
      order: random
      skipHeader: true
    - path: query_vocab.txt
      fields:
        - word9
      order: random
      skipHeader: true
scenarios:
  - name: ${APP_ID}
    flow:
      - get:
          url: "/search?query={{ word1 }}"
      - think: 3
      - get:
          url: "/search?query={{ word2 }}"
      - think: 3
      - get:
          url: "/search?query={{ word3 }}"
          capture:
            - json: $.results
              as: "decisions1"
      - think: 3
      - get:
          url: "/decision?id={{ decisions1[0].id }}"
      - think: 3
      - get:
          url: "/decision?id={{ decisions1[1].id }}"
      - think: 3
      - get:
          url: "/decision?id={{ decisions1[3].id }}"
      - get:
          url: "/search?query={{ word4 }}"
      - think: 3
      - get:
          url: "/search?query={{ word5 }}"
      - think: 3
      - get:
          url: "/search?query={{ word6 }}"
          capture:
            - json: $.results
              as: "decisions2"
      - think: 3
      - get:
          url: "/decision?id={{ decisions2[0].id }}"
      - think: 3
      - get:
          url: "/decision?id={{ decisions2[1].id }}"
      - think: 3
      - get:
          url: "/decision?id={{ decisions2[3].id }}"
      - get:
          url: "/search?query={{ word7 }}"
      - think: 3
      - get:
          url: "/search?query={{ word8 }}"
      - think: 3
      - get:
          url: "/search?query={{ word9 }}"
          capture:
            - json: $.results
              as: "decisions3"
      - think: 3
      - get:
          url: "/decision?id={{ decisions3[0].id }}"
      - think: 3
      - get:
          url: "/decision?id={{ decisions3[1].id }}"
      - think: 3
      - get:
          url: "/decision?id={{ decisions3[3].id }}"