scripts/perf/api_test.yaml
config:
  target: "${APP_SCHEME}://${APP_HOST}:${APP_PORT}"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 30
      arrivalRate: 2
    - duration: 30
      arrivalRate: 2
    - duration: 30
      arrivalRate: 5
    - duration: 30
      arrivalRate: 10
    - duration: 30
      arrivalRate: 20
    - duration: 60
      arrivalRate: 50
  payload:
    - path: query_vocab_gen.txt
      fields:
        - word1
      order: random
      skipHeader: true
    - path: query_vocab_gen.txt
      fields:
        - word2
      order: random
      skipHeader: true
    - path: query_vocab.txt
      fields:
        - word3
      order: random
      skipHeader: true

scenarios:
  - name: ${APP_ID}
    flow:
      - get:
          url: "/search?query={{ word1 }}"
      - think: 3
      - get:
          url: "/search?query={{ word2 }}"
      - think: 3
      - get:
          url: "/search?query={{ word3 }}"
          capture:
            - json: $.results[0].id
              as: "id"
      - think: 3
      - get:
          url: "/decisions?query={{ id }}"